In [1]:
# Q1. How do you create a pandas DataFrame from a dictionary where the keys are column names and the values are lists of data?

In [2]:
import pandas as pd
import numpy as np

In [60]:
df = pd.DataFrame({"id":[1,2,3,4,5,6,7,8,9],"name":['Olivia', 'Aditya', 'Cory', 'Isabell', 'Dominic', 'Tyler', 'Samuel', 'Daniel', 'Jeremy'],
                  "Age":[20, 25, 15, 10, 30, 65, 35, 18, 23],
                  "Product":[101,0, 106, 0, 103, 104,0 ,0 , 107],
                  "Purchased":['Watch','N/A', 'Oil', 'N/A', 'Shoes', 'Smartphone','N/A' ,'N/A' , 'Laptop'],
                  "City":['Mumbai', 'Delhi', 'Bangalore', 'Chennai', 'Chennai', 'Delhi', 'Kolkata', 'Delhi', 'Mumbai'],
                  "Sale_Amount":[10000,150000,2000,30000,15000,16000,15000,25000,48000]})
df

   id     name  Age  Product   Purchased       City  Sale_Amount
0   1   Olivia   20      101       Watch     Mumbai        10000
1   2   Aditya   25        0         N/A      Delhi       150000
2   3     Cory   15      106         Oil  Bangalore         2000
3   4  Isabell   10        0         N/A    Chennai        30000
4   5  Dominic   30      103       Shoes    Chennai        15000
5   6    Tyler   65      104  Smartphone      Delhi        16000
6   7   Samuel   35        0         N/A    Kolkata        15000
7   8   Daniel   18        0         N/A      Delhi        25000
8   9   Jeremy   23      107      Laptop     Mumbai        48000

In [38]:
# Q2. Explain the difference between .loc[] and .iloc[] in pandas. Provide an example where each is used.

In [39]:
#iloc perform index but loc perform label
# if index 1 is not there then loc goes error but
print(df.loc[1]) 
print("'''''''''''")
print(df.iloc[1])

id                  2
name           Aditya
Age                25
Product             0
Purchased         N/A
City            Delhi
Sale_Amount    150000
Name: 1, dtype: object
'''''''''''
id                  2
name           Aditya
Age                25
Product             0
Purchased         N/A
City            Delhi
Sale_Amount    150000
Name: 1, dtype: object

In [40]:
# Q3. How do you filter rows in a DataFrame where the values in a specific column are greater than a certain value?

In [41]:
df_filtered = df[df['Age'] > 25]
df_filtered

   id     name  Age  Product   Purchased     City  Sale_Amount
4   5  Dominic   30      103       Shoes  Chennai        15000
5   6    Tyler   65      104  Smartphone    Delhi        16000
6   7   Samuel   35        0         N/A  Kolkata        15000

In [42]:
# Q4. What methods can be used to compute the mean, median, and standard deviation of a DataFrame column?

In [43]:
print(df['Sale_Amount'].mean())
print(df['Sale_Amount'].median())
print(df['Sale_Amount'].std())

34555.555555555555
16000.0
45266.1880190698

In [44]:
"""
Q5. How can you add a new column to a DataFrame that is calculated from existing columns? For example, 
adding a column Total as the sum of two existing columns.
"""
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 90, 78],
    'Science': [88, 92, 84]
}

df1 = pd.DataFrame(data)

df1['Total'] = df1['Math'] + df1['Science']

print(df1)

      Name  Math  Science  Total
0    Alice    85       88    173
1      Bob    90       92    182
2  Charlie    78       84    162

In [4]:
"""
Q6. What are the ways to handle missing values in a pandas DataFrame? Explain with examples
how to drop rows with missing values or fill them with a specific value.
"""
data = {
    'Name': ['Alice', 'Bob', None, 'Charlie'],
    'Age': [25, np.nan, 30, 35],
    'City': ['New York', 'London', 'Paris', None]
}
df = pd.DataFrame(data)

df_dropped = df.dropna()

print(df_dropped)

    Name   Age      City
0  Alice  25.0  New York

In [5]:
df_dropped_columns = df.dropna(axis=1)

print(df_dropped_columns)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [6]:
df_filled = df.fillna({'Name': 'Unknown', 'Age': 0, 'City': 'Unknown'})

print(df_filled)

      Name   Age      City
0    Alice  25.0  New York
1      Bob   0.0    London
2  Unknown  30.0     Paris
3  Charlie  35.0   Unknown

In [7]:
# Forward fill (replace NaN with previous value)
df_filled_ffill = df.fillna(method='ffill')

# Backward fill (replace NaN with next value)
df_filled_bfill = df.fillna(method='bfill')

print("Forward Fill:")
print(df_filled_ffill)

print("\nBackward Fill:")
print(df_filled_bfill)

Forward Fill:
      Name   Age      City
0    Alice  25.0  New York
1      Bob  25.0    London
2      Bob  30.0     Paris
3  Charlie  35.0     Paris

Backward Fill:
      Name   Age      City
0    Alice  25.0  New York
1      Bob  30.0    London
2  Charlie  30.0     Paris
3  Charlie  35.0      None

In [14]:
mean_age = df['Age'].mean()
df_filled_mean = df['Age'].fillna(mean_age)

print(df_filled_mean)

0    25.0
1    30.0
2    30.0
3    35.0
Name: Age, dtype: float64

In [15]:
# Q7. How can you sort a pandas DataFrame by a specific column in ascending order? Provide an example.

In [17]:
df_sorted = df.sort_values(by='Age')
df_sorted

      Name   Age      City
0    Alice  25.0  New York
2     None  30.0     Paris
3  Charlie  35.0      None
1      Bob   NaN    London

In [ ]:
"""
Q8. How can you filter a pandas DataFrame to display rows where a 
specific column has a value greater than a given number (e.g., Age > 30)?
"""

In [22]:
df_filter = df[df['Age']>=30]
df_filter

      Name   Age   City
2     None  30.0  Paris
3  Charlie  35.0   None

In [24]:
# Q9. How can you slice a pandas DataFrame to select a specific range of rows (e.g., rows 10 to 20)?

In [28]:
df_range = df.iloc[1:3]
df_range

   Name   Age    City
1   Bob   NaN  London
2  None  30.0   Paris